Revit 2027 API
RevisionsOnSheetUIServiceData.GetParentHwnd Method
Note: This API is now obsolete.
 return the parent handle
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
public IntPtr GetParentHwnd()
<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>
Public Function GetParentHwnd As IntPtr
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
IntPtr GetParentHwnd()
[<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>]
member GetParentHwnd : unit -> IntPtr
Return Value
IntPtr
See Also
Reference
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace